/* Подвиг 5. Напишите программу, которая читает из входного потока три целых числа, записанных в одну строчку через пробел, и вычисляет их сумму с помощью функции get_sum2. Эта функция должна принимать два целых числа, а возвращать - одно целое число (сумму от двух переданных чисел). Функцию get_sum2 необходимо вызвать (возможно несколько раз) для вычисления суммы трех прочитанных целых чисел. Выведите результат итогового вычисления в консоль в виде целого числа.

 https://stepik.org/lesson/1191303/step/7?unit=1204291 */

#include <stdio.h>

int get_sum2(int n, int m)
{
    return n + m;
}

int main(void)
{
    int a, b, c;
    scanf("%d %d %d", &a, &b, &c);
    
    int res = get_sum2(a, b);
    int res_end = get_sum2(res, c);
    
    printf("%d", res_end);

    return 0;
}