/* Подвиг 4. Напишите программу, которая читает из входного потока два целых числа, записанных в одну строчку через пробел, и вычисляет их среднее арифметическое с помощью функции get_mean2. Эта функция должна принимать два целых числа, а возвращать - вещественное число (среднее арифметическое). Вызовите функцию get_mean2 для прочитанных целых чисел и выведите результат ее работы в консоль в виде вещественного числа с точностью до десятых.

https://stepik.org/lesson/1191303/step/6?unit=1204291 */

#include <stdio.h>

float get_mean2(int n, int m)
{
    float res = (n + m) / 2.0;
    return res;
}


int main(void)
{
    int n, m;
    float res;
    scanf("%d%d", &n, &m);
    res = get_mean2(n, m);
    printf("%.1f", res);
    return 0;
}